---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeTypeOptions.#ctor
source: html/da8bdaea-2cc6-2a3d-4d7a-74fb49c72a12.htm
---
# Autodesk.Revit.DB.DirectShapeTypeOptions.#ctor Method

Constructs a new DirectShapeTypeOptions instance with default settings.

## Syntax (C#)
```csharp
public DirectShapeTypeOptions()
```